Revit 2024 API
ViewSystemsAnalysisReport.WeatherFile Property
 The full path name of the weather file used for the systems analysis.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public string WeatherFile { get; }
Visual Basic
Public ReadOnly Property WeatherFile As String
	Get
Visual C++
public:
property String^ WeatherFile {
	String^ get ();
}
See Also
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace